---
type: InitialIntensity
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 4
tags: [revit-api, class]
---

# InitialIntensity

`Autodesk.Revit.DB.Lighting.InitialIntensity` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Clone | 2013 | `public InitialIntensity Clone ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | InitialIntensityValue | 2013 | `public double InitialIntensityValue { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |